

# Parameters
nc: 16 # number of classes
depth_multiple: 1 # model depth multiple
width_multiple: 1 # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# Patch-DCL
backbone:
  # [from, number, module, args]
  [[-1, 1, Patch, [48,4,4]],  # 0-P1/2
   [-1, 1, DCL, [64]],
   [-1, 1, DCL, [64]],
   [-1, 1, Patch, [128, 2, 2]],  # 3-P3/8
   [-1, 3, DCL, [128]],
   [-1, 1, Patch, [256, 2, 2]],  # 5-P4/16
   [-1, 3, DCL, [256]],      #6
   [-1, 1, Patch, [512, 2, 2]],  # 7-P5/32
     [-1, 1, DCL, [512]],
   [-1, 1, SPPF, [512, 5]]
  ]


head:
  [[-1, 1, CSPl, [512]],
    [[6, 10], 1, OGF_NEM, [1]],
   [-1, 1, CSPl, [256]],   #11
    [[ 4, 6], 1, OGF_NEM, [1]],
    [ -1, 1, CSPl, [128] ], #13

   [[13,11,9], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
